Revit 2027 API
SolidUtils.Clone Method
 Creates a new Solid which is a copy of the input Solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Solid Clone(
	Solid solid
)
Public Shared Function Clone (
	solid As Solid
) As Solid
public:
static Solid^ Clone(
	Solid^ solid
)
static member Clone :
        solid : Solid -> Solid
Parameters
solid Solid
 The input solid to be copied.
Return Value
Solid
 The newly created Solid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SolidUtils Class
Autodesk.Revit.DB Namespace